# Data Structure - 3
-  pandas

## Pandas
-  http://cs231n.github.io/python-numpy-tutorial/
-  pandas - dataframe, excel like 
-  https://mode.com/python-tutorial/pandas-dataframe/ 
-  https://pandas.pydata.org/pandas-docs/stable/
-

In [1]:
import pandas as pd
#https://pandas.pydata.org/
print(pd.__version__)

2.1.0

In [3]:
#from list
my_list = [1,2,3,4,5,10]
df = pd.DataFrame(my_list , columns = ['columnName'])
df

   columnName
0           1
1           2
2           3
3           4
4           5
5          10

In [5]:
# from dictionary
my_dict = { 'A':[1,2,3,5, 9], 'B': [10, 20, 5, 39, 7]}
df = pd.DataFrame(my_dict)
df

   A   B
0  1  10
1  2  20
2  3   5
3  5  39
4  9   7

In [8]:
df.loc[0]  #row label

A     1
B    10
Name: 0, dtype: int64

In [9]:
df.iloc[0] # row index

A     1
B    10
Name: 0, dtype: int64

In [13]:
df.iat[0,0]  #single value interesction of row and col; col & row by index

1

In [14]:
df.at[0,'A']  #column by name

1

In [17]:
df.rename(columns = {'A':'newA'})

   newA   B
0     1  10
1     2  20
2     3   5
3     5  39
4     9   7

In [18]:
df['A'].apply(lambda x : x*2)

0     2
1     4
2     6
3    10
4    18
Name: A, dtype: int64

In [19]:
df.replace(1, 10)

    A   B
0  10  10
1   2  20
2   3   5
3   5  39
4   9   7

In [20]:
df.agg({'A':['min', 'max', 'mean', 'sum']})

         A
min    1.0
max    9.0
mean   4.0
sum   20.0

In [25]:
df1 = pd.DataFrame({'rollno':[1,2,3], 'marks1':[4,5,6]})
df2 = pd.DataFrame({'rollno':[1,2,3], 'marks2':[7,8,9]})
print(df1)
df = pd.merge(df1, df2, on='rollno') #
#merge is more versatile, it requires specifying the columns as a merge key. 
print(df)

   rollno  marks1
0       1       4
1       2       5
2       3       6
   rollno  marks1  marks2
0       1       4       7
1       2       5       8
2       3       6       9

In [29]:
df1 = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6]})
df2 = pd.DataFrame({'C':[7,8,9]})
print (df1,'\n', df2)
df = df1.join(df2)  #using index key
df

   A  B
0  1  4
1  2  5
2  3  6
    C
0  7
1  8
2  9

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [30]:
df['date'] = pd.to_datetime('2023-10-02')
df

   A  B  C       date
0  1  4  7 2023-10-02
1  2  5  8 2023-10-02
2  3  6  9 2023-10-02

In [33]:
import datetime as dt

In [37]:
print(df['date'].dt.year)
print(df['date'].dt.month)
print(df['date'].dt.day)

0    2023
1    2023
2    2023
Name: date, dtype: int32
0    10
1    10
2    10
Name: date, dtype: int32
0    2
1    2
2    2
Name: date, dtype: int32

In [38]:
df.to_csv('filedf.csv', index=False)

In [40]:
os.listdir()

NameError: name 'os' is not defined

In [ ]:
## larger DF

In [3]:
df1 = pd.DataFrame({'rollno':[1,2,3,4,5], 
                    'name': [ "Dhiraj", "Kounal", "Akhil", "Pooja","Disha" ], 
                    'marks':[ 40, 50, 60.5, 70, 93 ], 
                    'gender':['M', 'M','M', 'F', 'F']})
print(df1)  # dict format
type(df1)

   rollno    name  marks gender
0       1  Dhiraj   40.0      M
1       2  Kounal   50.0      M
2       3   Akhil   60.5      M
3       4   Pooja   70.0      F
4       5   Disha   93.0      F

pandas.core.frame.DataFrame

In [29]:
print('Column Names - ', df1.columns)  #column names
print('Index/ Row Names - ', df1.index)  #row ids/ names  - here auto created
print('Data Types -\n', df1.dtypes) #data types
print('Shape of DF(R-C) -', df1.shape)  # rows and columns

Column Names -  Index(['rollno', 'name', 'marks', 'gender'], dtype='object')
Index/ Row Names -  RangeIndex(start=0, stop=5, step=1)
Data Types -
 rollno      int64
name       object
marks     float64
gender     object
dtype: object
Shape of DF(R-C) - (5, 4)

In [30]:
print('Describe Values (Numerical)-\t  ')
df1.describe() #description of numerical values

Describe Values (Numerical)-

         rollno      marks
count  5.000000   5.000000
mean   3.000000  62.700000
std    1.581139  20.327322
min    1.000000  40.000000
25%    2.000000  50.000000
50%    3.000000  60.500000
75%    4.000000  70.000000
max    5.000000  93.000000

In [31]:
# Groupby Functions on DF
df1.groupby('gender').size()  # how many M, F

gender
F    2
M    3
dtype: int64